# Pandas

### data frame

In [7]:
import pandas as pd

In [8]:
['a']*10

['a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a']

In [9]:
frame = pd.DataFrame({'num':range(10),'chars':['a']*10})

In [10]:
frame

   num chars
0    0     a
1    1     a
2    2     a
3    3     a
4    4     a
5    5     a
6    6     a
7    7     a
8    8     a
9    9     a

In [11]:
dataset = pd.read_csv('dataset.tsv',header=0,sep='\t')

In [12]:
dataset

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [13]:
dataset.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [15]:
dataset.shape

(6, 4)

In [16]:
new_line = {'Name':'Ivan','Birth':'21.01.1991','City':'Moskow'}

In [17]:
dataset.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6             Ivan  21.01.1991     Moskow       NaN

In [18]:
dataset = dataset.append(new_line, ignore_index=True)

In [19]:
dataset

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6             Ivan  21.01.1991     Moskow       NaN

In [21]:
dataset['Studens'] = [False]*3 + [True]*4

In [22]:
dataset

              Name       Birth       City  Position  Studens
0      Иванов А.А.  22.03.1980     Москва       NaN    False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер    False
2       Белов М.М.  13.02.1980     Ростов  менеджер    False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     True
4      Рыбина Е.П.  19.11.1985     Москва   инженер     True
5     Костров С.О.  31.05.1985     Москва    стажер     True
6             Ivan  21.01.1991     Moskow       NaN     True

In [23]:
dataset.drop([5,6], axis=0)

              Name       Birth       City  Position  Studens
0      Иванов А.А.  22.03.1980     Москва       NaN    False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер    False
2       Белов М.М.  13.02.1980     Ростов  менеджер    False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     True
4      Рыбина Е.П.  19.11.1985     Москва   инженер     True

In [24]:
dataset

              Name       Birth       City  Position  Studens
0      Иванов А.А.  22.03.1980     Москва       NaN    False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер    False
2       Белов М.М.  13.02.1980     Ростов  менеджер    False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     True
4      Рыбина Е.П.  19.11.1985     Москва   инженер     True
5     Костров С.О.  31.05.1985     Москва    стажер     True
6             Ivan  21.01.1991     Moskow       NaN     True

In [25]:
dataset.drop([5,6], axis=0, inplace=True)

In [26]:
dataset

              Name       Birth       City  Position  Studens
0      Иванов А.А.  22.03.1980     Москва       NaN    False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер    False
2       Белов М.М.  13.02.1980     Ростов  менеджер    False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     True
4      Рыбина Е.П.  19.11.1985     Москва   инженер     True

In [27]:
dataset.drop('Studens',axis=1, inplace=True)

In [28]:
dataset

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [30]:
dataset.to_csv('new.csv',sep=',',header=True,index=None)

In [31]:
!cat new.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер